experiments/workflow/boki-hotel/expected_results/qps200/wrk.log
Running 2m test @ http://ip-172-31-7-164.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 0.802ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.904ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.99ms    5.88ms  47.55ms   96.00%
    Req/Sec   103.71     52.83   600.00     88.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.89ms
 75.000%    1.15ms
 90.000%    1.28ms
 99.000%   37.60ms
 99.900%   43.39ms
 99.990%   47.39ms
 99.999%   47.58ms
100.000%   47.58ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.226     0.000000            1         1.00
       0.473     0.100000         2815         1.11
       0.563     0.200000         5605         1.25
       0.664     0.300000         8404         1.43
       0.791     0.400000        11218         1.67
       0.890     0.500000        14015         2.00
       0.937     0.550000        15432         2.22
       0.987     0.600000        16816         2.50
       1.046     0.650000        18199         2.86
       1.106     0.700000        19611         3.33
       1.151     0.750000        21014         4.00
       1.172     0.775000        21717         4.44
       1.192     0.800000        22416         5.00
       1.215     0.825000        23120         5.71
       1.236     0.850000        23805         6.67
       1.260     0.875000        24515         8.00
       1.269     0.887500        24850         8.89
       1.283     0.900000        25225        10.00
       1.296     0.912500        25569        11.43
       1.314     0.925000        25918        13.33
       1.331     0.937500        26263        16.00
       1.346     0.943750        26431        17.78
       1.398     0.950000        26599        20.00
       4.011     0.956250        26780        22.86
      13.823     0.962500        26951        26.67
      13.887     0.968750        27125        32.00
      23.679     0.971875        27222        35.56
      23.711     0.975000        27322        40.00
      23.743     0.978125        27409        45.71
      33.535     0.981250        27503        53.33
      33.567     0.984375        27626        64.00
      33.567     0.985938        27626        71.11
      33.599     0.987500        27698        80.00
      33.599     0.989062        27698        91.43
      43.327     0.990625        27736       106.67
      43.359     0.992188        27927       128.00
      43.359     0.992969        27927       142.22
      43.359     0.993750        27927       160.00
      43.359     0.994531        27927       182.86
      43.359     0.995313        27927       213.33
      43.359     0.996094        27927       256.00
      43.359     0.996484        27927       284.44
      43.359     0.996875        27927       320.00
      43.359     0.997266        27927       365.71
      43.391     0.997656        27977       426.67
      43.391     0.998047        27977       512.00
      43.391     0.998242        27977       568.89
      43.391     0.998437        27977       640.00
      43.391     0.998633        27977       731.43
      43.391     0.998828        27977       853.33
      43.391     0.999023        27977      1024.00
      43.391     0.999121        27977      1137.78
      43.391     0.999219        27977      1280.00
      47.359     0.999316        27990      1462.86
      47.359     0.999414        27990      1706.67
      47.359     0.999512        27990      2048.00
      47.359     0.999561        27990      2275.56
      47.359     0.999609        27990      2560.00
      47.359     0.999658        27990      2925.71
      47.359     0.999707        27990      3413.33
      47.391     0.999756        27997      4096.00
      47.391     0.999780        27997      4551.11
      47.391     0.999805        27997      5120.00
      47.391     0.999829        27997      5851.43
      47.391     0.999854        27997      6826.67
      47.391     0.999878        27997      8192.00
      47.391     0.999890        27997      9102.22
      47.391     0.999902        27997     10240.00
      47.391     0.999915        27997     11702.86
      47.391     0.999927        27997     13653.33
      47.391     0.999939        27997     16384.00
      47.391     0.999945        27997     18204.44
      47.391     0.999951        27997     20480.00
      47.391     0.999957        27997     23405.71
      47.391     0.999963        27997     27306.67
      47.583     0.999969        27998     32768.00
      47.583     1.000000        27998          inf
#[Mean    =        1.994, StdDeviation   =        5.882]
#[Max     =       47.552, Total count    =        27998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  236.00us
 75.000%  263.00us
 90.000%  284.00us
 99.000%    5.24ms
 99.900%   43.01ms
 99.990%   46.97ms
 99.999%   47.01ms
100.000%   47.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.116     0.000000            3         1.00
       0.174     0.100000         2904         1.11
       0.188     0.200000         5784         1.25
       0.203     0.300000         8517         1.43
       0.222     0.400000        11363         1.67
       0.236     0.500000        14123         2.00
       0.242     0.550000        15531         2.22
       0.247     0.600000        16870         2.50
       0.253     0.650000        18452         2.86
       0.258     0.700000        19777         3.33
       0.263     0.750000        21026         4.00
       0.266     0.775000        21699         4.44
       0.269     0.800000        22408         5.00
       0.273     0.825000        23305         5.71
       0.276     0.850000        23890         6.67
       0.280     0.875000        24669         8.00
       0.282     0.887500        25001         8.89
       0.284     0.900000        25322        10.00
       0.286     0.912500        25673        11.43
       0.288     0.925000        25953        13.33
       0.291     0.937500        26305        16.00
       0.293     0.943750        26536        17.78
       0.294     0.950000        26639        20.00
       0.296     0.956250        26807        22.86
       0.298     0.962500        26969        26.67
       0.301     0.968750        27146        32.00
       0.302     0.971875        27215        35.56
       0.304     0.975000        27314        40.00
       0.307     0.978125        27410        45.71
       0.310     0.981250        27487        53.33
       0.314     0.984375        27572        64.00
       0.316     0.985938        27606        71.11
       0.323     0.987500        27650        80.00
       0.335     0.989062        27695        91.43
      42.879     0.990625        27778       106.67
      42.911     0.992188        27853       128.00
      42.911     0.992969        27853       142.22
      42.911     0.993750        27853       160.00
      42.911     0.994531        27853       182.86
      42.943     0.995313        27944       213.33
      42.943     0.996094        27944       256.00
      42.943     0.996484        27944       284.44
      42.943     0.996875        27944       320.00
      42.943     0.997266        27944       365.71
      42.943     0.997656        27944       426.67
      42.943     0.998047        27944       512.00
      42.975     0.998242        27968       568.89
      42.975     0.998437        27968       640.00
      42.975     0.998633        27968       731.43
      42.975     0.998828        27968       853.33
      43.007     0.999023        27977      1024.00
      43.007     0.999121        27977      1137.78
      43.007     0.999219        27977      1280.00
      46.847     0.999316        27979      1462.86
      46.911     0.999414        27984      1706.67
      46.943     0.999512        27990      2048.00
      46.943     0.999561        27990      2275.56
      46.943     0.999609        27990      2560.00
      46.943     0.999658        27990      2925.71
      46.943     0.999707        27990      3413.33
      46.975     0.999756        27997      4096.00
      46.975     0.999780        27997      4551.11
      46.975     0.999805        27997      5120.00
      46.975     0.999829        27997      5851.43
      46.975     0.999854        27997      6826.67
      46.975     0.999878        27997      8192.00
      46.975     0.999890        27997      9102.22
      46.975     0.999902        27997     10240.00
      46.975     0.999915        27997     11702.86
      46.975     0.999927        27997     13653.33
      46.975     0.999939        27997     16384.00
      46.975     0.999945        27997     18204.44
      46.975     0.999951        27997     20480.00
      46.975     0.999957        27997     23405.71
      46.975     0.999963        27997     27306.67
      47.007     0.999969        27998     32768.00
      47.007     1.000000        27998          inf
#[Mean    =        0.653, StdDeviation   =        4.239]
#[Max     =       46.976, Total count    =        27998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30002 requests in 2.50m, 4.66MB read
Requests/sec:    200.01
Transfer/sec:     31.84KB